{"modelTopology": {"keras_version": "2.1.4", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_10", "trainable": true, "batch_input_shape": [null, 16], "dtype": "float32", "input_dim": 44932, "output_dim": 256, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 16}}, {"class_name": "GRU", "config": {"name": "gru_19", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.9, "recurrent_dropout": 0.0, "implementation": 1}}, {"class_name": "GRU", "config": {"name": "gru_20", "trainable": true, "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "units": 256, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.9, "recurrent_dropout": 0.0, "implementation": 1}}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}, "training_config": {"optimizer_config": {"class_name": "Adam", "config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-07, "amsgrad": false}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null, "loss_weights": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "dense_10/kernel", "shape": [256, 2], "dtype": "float32"}, {"name": "dense_10/bias", "shape": [2], "dtype": "float32"}]}, {"paths": ["group2-shard1of11", "group2-shard2of11", "group2-shard3of11", "group2-shard4of11", "group2-shard5of11", "group2-shard6of11", "group2-shard7of11", "group2-shard8of11", "group2-shard9of11", "group2-shard10of11", "group2-shard11of11"], "weights": [{"name": "embedding_10/embeddings", "shape": [44932, 256], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "gru_19/kernel", "shape": [256, 768], "dtype": "float32"}, {"name": "gru_19/recurrent_kernel", "shape": [256, 768], "dtype": "float32"}, {"name": "gru_19/bias", "shape": [768], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "gru_20/kernel", "shape": [256, 768], "dtype": "float32"}, {"name": "gru_20/recurrent_kernel", "shape": [256, 768], "dtype": "float32"}, {"name": "gru_20/bias", "shape": [768], "dtype": "float32"}]}]}